<?php

use Illuminate\Database\Seeder;

class MenusTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('menus')->insert([
            [
                'name' => 'หน้าแรก', //1
                'slug' => 'หน้าแรก',
                'parent_id' => 0  
            ],
            [
                'name' => 'แนะนำสวทช', //2
                'slug' => 'แนะนำสวทช',
                'parent_id' => 0  
            ],
            [
                'name' => 'กองทุนพัฒนา ว และ ท', //3
                'slug' => 'กองทุนพัฒนา-ว-และ-ท',
                'parent_id' => 0  
            ],
            [
                'name' => 'งานเพื่ออุตสาหกรรม', //4
                'slug' => 'งานเพื่ออุตสาหกรรม',
                'parent_id' => 0  
            ],
            [
                'name' => 'งานเพื่อสังคม', //5
                'slug' => 'งานเพื่อสังคม',
                'parent_id' => 0  
            ],
            [
                'name' => 'บริการจากสวทช.', //6
                'slug' => 'บริการจากสวทช.',
                'parent_id' => 0  
            ],
            [
                'name' => 'ติดต่อ สวทช.', //7
                'slug' => 'ติดต่อ-สวทช.',
                'parent_id' => 0  
            ],
            [
                'name' => 'เทคโนโลยี', //8
                'slug' => 'เทคโนโลยี',
                'parent_id' => 0  
            ],
            [
                'name' => 'โครงสร้างองค์กร', //9
                'slug' => 'โครงสร้างองค์กร',
                'parent_id' => 1
            ],
            [
                'name' => 'ทำเนียบผู้บริหาร', //10
                'slug' => 'ทำเนียบผู้บริหาร',
                'parent_id' => 1 
            ],
            [
                'name' => 'กวทช.', //11
                'slug' => 'กวทช.',
                'parent_id' => 1  
            ],
            [
                'name' => 'สถิติ', //12
                'slug' => 'สถิติ',
                'parent_id' => 1
            ],
            [
                'name' => 'วีดีโอแนะนำ สวทช.', //13
                'slug' => 'วีดีโอแนะนำ-สวทช.',
                'parent_id' => 1 
            ],
            [
                'name' => 'ตราสัญลักษณ์', //14
                'slug' => 'ตราสัญลักษณ์',
                'parent_id' => 1 
            ],
            [
                'name' => 'สอบถามข้อมูล', //15
                'slug' => 'สอบถามข้อมูล',
                'parent_id' => 7 
            ],
            [
                'name' => 'ข้อเสนอแนะ', //16
                'slug' => 'ข้อเสนอแนะ',
                'parent_id' => 7
            ],
            [
                'name' => 'ข้อร้องเรียนทั่วไป', //17
                'slug' => 'ข้อร้องเรียนทั่วไป',
                'parent_id' => 7
            ],
            [
                'name' => 'ร้องเรียนเกี่ยวกับจริยธรรมวิจัย', //18
                'slug' => 'ร้องเรียนเกี่ยวกับจริยธรรมวิจัย',
                'parent_id' => 7
            ]

        ]);
    }
}
